# LinkOperations Properties

---
The LinkOperations type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
LinkOperations Class
Autodesk.Revit.DB Namespace